Revit 2024 API
LineLightShape Constructor
 Creates a line light shape object with 2.0' emit length.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public LineLightShape()
Visual Basic
Public Sub New
Visual C++
public:
LineLightShape()
See Also
LineLightShape Class
LineLightShape Overload
Autodesk.Revit.DB.Lighting Namespace